#include <iostream>

/*
Инженеры компании «Спейс Инжиниринг» не могут продуктивно работать без кофе. 
Недавно в их кофемашину случайно попал космический луч и повредил программу-прошивку. 
Вас умоляют помочь. Кофемашина умеет готовить два напитка: американо и латте. 
Для американо требуется 300 мл воды, а для латте 30 мл воды и 270 мл молока.

Напишите программу, которая спрашивает у пользователя (это действие программа делает один раз в начале работы), 
сколько всего миллилитров молока и воды залито в кофемашину, после чего начинает обслуживание, спрашивая, 
какой напиток хочет очередной посетитель. 
Пользователь выбирает один из двух напитков, программа отвечает одним из трёх вариантов: 
«Ваш напиток готов», «Не хватает воды» или «Не хватает молока», после чего переходит к обслуживанию следующего посетителя. 
Если молока и воды не хватает ни на один вид напитка, программа выдаёт отчёт и завершается. 
В отчёте должно быть написано, что ингредиенты подошли к концу, должен быть указан остаток воды и молока в машине, 
а также должно быть указано, сколько всего было приготовлено чашек американо и латте за эту смену. 
Выберите наиболее удобный для написания программы цикл. Обеспечьте контроль ввода.

Пример выполнения

            Введите количество воды в мл: 30 
            Введите количество молока в мл: 270 
            Выберите напиток (1 — американо, 2 — латте): 2 
            Ваш напиток готов. 
            ***Отчёт*** 
            Ингредиентов осталось: 
                        Вода: 0 мл 
                        Молоко: 0 мл 
            Кружек американо приготовлено: 0 
            Кружек латте приготовлено: 1

Рекомендации по выполнению
    Перед тем как останавливать работу кофемашины, нужно убедиться, что ни один из напитков нельзя приготовить.
    Количество напитков разных видов следует считать отдельно.
    Для решения программы рекомендуется использовать цикл while.
Что оценивается
    Правильно определяется количество оставшихся ингредиентов.
    Количество ингредиентов не становится отрицательным.
    Программа не выводит отчёт, если количества ингредиентов хватает хотя бы на один из напитков.
    Если ингредиентов не хватает для приготовления любого из напитков, программа должна вывести отчёт.
*/

int main() {
    int waterCnt = 0, milkCnt = 0;
    int latteWaterCnt = 30, latteMilkCnt = 270, americanoWaterCnt = 300;

    std:: cout << "Введите количество воды в мл: ";
    std::cin >> waterCnt;
    std:: cout << "Введите количество молока в мл: ";
    std::cin >> milkCnt;
    if (waterCnt < 0 || milkCnt < 0) {
        std::cout << "Введено некорректное количество молока или воды!";
        return 0;
    }

    int americanoCnt = 0, latteCnt = 0;
    while (waterCnt >= latteWaterCnt && milkCnt >= latteMilkCnt || waterCnt >= americanoWaterCnt) {
        int req = 0;
        while (req != 1 && req != 2) {
            std::cout << "Выберите напиток (1 — американо, 2 — латте): ";
            std::cin >> req;
        }
        if (req == 1) {
            if (waterCnt >= americanoWaterCnt) {
                std::cout << "Ваш напиток готов.\n";
                americanoCnt++;
                waterCnt -= americanoWaterCnt;
            } else {
                std::cout << "Не зватает воды.\n";
            }
        } else {
            if (waterCnt >= latteWaterCnt && milkCnt >= latteMilkCnt) {
                std::cout << "Ваш напиток готов.\n";
                latteCnt++;
                waterCnt -= latteWaterCnt;
                milkCnt -= latteMilkCnt;
            } else if (waterCnt < latteWaterCnt) {
                std::cout << "Не зватает воды.\n";
            } else {
                std::cout << "Не зватает молока.\n";
            }
        }
    }
    std::cout << "***Отчёт***\n";
    std::cout << "Ингридиентов осталось: \n";
    std::cout << "\t\tВода: " << waterCnt <<" мл\n";
    std::cout << "\t\tМолоко: " << milkCnt <<" мл\n";
    std::cout << "Кружек американо приготовлено: " << americanoCnt << "\n";
    std::cout << "Кружек латте приготовлено: " << latteCnt << "\n";

    return 0;
}